Revit 2015 API
IFCTypeInfo.GetStyle Method
 Gets the associated handle to an IfcTypeProduct for the type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public IFCAnyHandle GetStyle()
Visual Basic
Public Function GetStyle As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ GetStyle()
Return Value
 The handle.
See Also
IFCTypeInfo Class
Autodesk.Revit.DB.IFC Namespace